In [1]:
import pandas as pd

friends = [{'age':15, 'job':'student'},
          {'age':25, 'job':'developer'},
          {'age':30, 'job':'teacher'}]

df = pd.DataFrame(friends,
                 index = ['John', 'Jenny', 'Nate'],
                 columns = ['age', 'job'])

In [2]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [3]:
# 없애고 싶은 index name을 적는다
df.drop(['John', 'Nate'])

       age        job
Jenny   25  developer

In [4]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [5]:
df = df.drop(['John', 'Nate'])

In [6]:
df

       age        job
Jenny   25  developer

In [7]:
df = pd.DataFrame(friends,
                 index = ['John', 'Jenny', 'Nate'],
                 columns = ['age', 'job'])

In [8]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [9]:
# inplace = True시 drop한 value가 바로 데이터프레임에 적용됨
df.drop(['John', 'Nate'], inplace = True)

In [10]:
df

       age        job
Jenny   25  developer

In [15]:
import pandas as pd

friends = [{'name' : 'John','age':15, 'job':'student'},
          {'name' : 'Ben','age':25, 'job':'developer'},
          {'name' : 'Jenny','age':30, 'job':'teacher'}]

df = pd.DataFrame(friends,
                 columns = ['name','age', 'job'])

In [16]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [18]:
# index로 삭제
df = df.drop(df.index[[0,2]])

In [19]:
df

  name  age        job
1  Ben   25  developer

In [20]:
df = pd.DataFrame(friends,
                 columns = ['name','age', 'job'])

In [21]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [22]:
# 나이가 20살 이상인것만 취하고 싶을 때
df = df[df.age > 20]

In [24]:
df

    name  age        job
1    Ben   25  developer
2  Jenny   30    teacher

In [25]:
df = pd.DataFrame(friends,
                 columns = ['name','age', 'job'])

In [26]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [27]:
# age라는 column을 없애고 싶을 때
df = df.drop('age', axis=1)

In [28]:
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher

In [35]:
df = pd.DataFrame(friends,
                 columns = ['name','age', 'job'])

In [36]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [37]:
df.drop('age', axis=1, inplace = True)

In [38]:
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher